Repository: visol/ext-newsletterregistration
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# pluginLabel
source: Newsletter Registration
de: Newsletter-Anmeldung

# flexform.sheetTitle
source: Configuration
de: Konfiguration

# flexform.newsletterTitle
source: Title of newsletter
de: Titel des Newsletters

# flexform.fieldList
source: User fields to display after opt-in (optional)
de: Optionale Benutzer-Felder, die nach dem Opt-in angezeigt werden

# flexform.userFolder
source: User storage folder
de: Benutzerordner

# newFrontendUser.introduction
source: Please enter your e-mail address to subscribe to the newsletter "%s".
de: Bitte geben Sie Ihre E-Mail-Adresse ein, um sich für den Newsletter "%s" anzumelden.

# newFrontendUser.submit
source: Register
de: Anmelden

# newFrontendUser.errorMessage
source: Validation of form data failed. Please correct the marked fields and submit again.
de: Validierung der Formulardaten fehlgeschlagen. Bitte korrigieren Sie die markierten Felder und klicken Sie nochmals auf anmelden.

# createFrontendUser.introduction
source: Thank you for registering. We have sent you a confirmation e-mail. Please click the link in this e-mail to complete the registration process.
de: Besten Dank für Ihre Anmeldung. Wir haben Ihnen eine Bestätigungs-E-Mail gesendet. Bitte klicken Sie auf den Link in dieser E-Mail, um die Anmeldung abzuschliessen.

# createFrontendUser.optInEmail.activate
source: <p>Thank you for registering for the newsletter "%1$s". To complete the registration process, please click the link below:</p> <p>%2$s</p> <p>If you didn't register for this newsletter, please ignore this e-mail.</p>
de: <p>Besten Dank für Ihre Anmeldung für den Newsletter "%1$s". Klicken Sie bitte auf den untenstehenden Link, um die Anmeldung abzuschliessen:</p> <p>%2$s</p> <p>Sollten Sie sich nicht für diesen Newsletter angemeldet haben, ignorieren Sie bitte diese E-Mail.</p>

# createFrontendUser.optInEmail.edit
source: <p>You are already subscribed to the newsletter "%1$s". If you like to edit your user information or unsubscribe, please click the link below:</p> <p>%2$s</p>
de: <p>Sie haben den Newsletter "%1$s" bereits abonniert. Klicken Sie bitte auf den untenstehenden Link, falls Sie Ihre Benutzerdaten bearbeiten oder sich abmelden möchten:</p> <p>%2$s</p>

# createFrontendUser.optInEmail.edit.unsubscribeOnly
source: <p>You are already subscribed to the newsletter "%1$s". If you like to unsubscribe, please click the link below:</p> <p>%2$s</p>
de: <p>Sie haben den Newsletter "%1$s" bereits abonniert. Klicken Sie bitte auf den untenstehenden Link, falls Sie sich abmelden möchten:</p> <p>%2$s</p>

# activateFrontendUser.invalidLink
source: The confirmation link provided is invalid. If you copied the link from your e-mail client, please make sure that you selected the whole link.
de: Der Bestätigungs-Link ist ungültig. Falls Sie ihn aus Ihrem E-Mail-Programm kopiert haben, stellen Sie bitte sicher, dass Sie den kompletten Link markiert haben.

# activateFrontendUser.success
source: Your subscription was successfully confirmed. You will receive further issues of the newsletter "%s".
de: Ihre Anmeldung wurde erfolgreich bestätigt. Sie werden nun die Ausgaben des Newsletters "%s" erhalten.

# editFrontendUser.editTitle
source: Personal data
de: Persönliche Angaben

# editFrontendUser.editIntroduction
source: If you wish to receive a personalized newsletter, please update your personal data.
de: Um einen personalisierten Newsletter zu empfangen, können Sie Ihre persönlichen Daten eintragen.

# editFrontendUser.submit
source: Save
de: Speichern

# editFrontendUser.unsubscribeTitle
source: Cancel subscription
de: Abonnement beenden

# editFrontendUser.unsubscribeButton
source: Cancel my subscription
de: Newsletter abbestellen

# updateFrontendUser.success
source: Your personal data was updated successfully.
de: Ihre persönlichen Angaben wurden erfolgreich aktualisiert.

# updateFrontendUser.error
source: Your personal data was could not be updated. Please try again.
de: Ihre persönlichen Angaben konnten nicht aktualisiert werden. Bitte versuchen Sie es nochmals.

# deleteFrontendUser.success
source: Your subscription was cancelled successfully and your personal data was removed from our system.
de: Ihr Abonnement wurde erfolgreich beendet und Ihre persönlichen Daten wurden aus unserem System gelöscht.

# deleteFrontendUser.error
source: Your subscription could not be cancelled. Please make sure you used a valid unsubscribe link. If the problem persists, please contact us for further assistance.
de: Ihr Abonnement konnte nicht beendet werden. Bitte stellen Sie sicher, dass Sie einen gültigen Abmelde-Link benutzen. Bitte kontaktieren Sie uns, falls das Problem weiterhin besteht.

# labels.gender
source: Salutation
de: Anrede

# labels.gender.m
source: Mr.
de: Herr

# labels.gender.f
source: Ms.
de: Frau

# labels.firstName
source: First name
de: Vorname

# labels.lastName
source: Last name
de: Name
